Repository: 6-5/6-5
Catalog: app/Resources/translations/ranks.*.xlf
Languages: de, fr, it

source: recruit
de: rekr
fr: recrue
it: recluta

# recruit.abbr
source: recr
it: recl

source: private
de: soldat
fr: soldat
it: soldato

# private.abbr
source: pte
de: sdt
fr: sdt
it: sdt

source: appointee
de: gefreiter
fr: appointé
it: appuntato

# appointee.abbr
source: apt
de: gfr
fr: app
it: app

source: private first class
de: obergefreiter
fr: appointé-chef
it: appuntato capo

# private_first_class.abbr
source: pfc
de: obgfr
fr: app chef
it: app capo

source: corporal
de: korporal
fr: caporal
it: corporale

source: sergeant
de: wachtmeister
fr: sergent
it: sergente

source: chief sergeant
de: oberwachtmeister
fr: sergent-chef
it: sergente capo

# chief_sergeant.abbr
source: csgt
de: obwm
fr: sgt chef
it: sgt capo

source: master sergeant
de: feldweibel
fr: sergent-major
it: sergent maggiore

# master_sergeant.abbr
source: ssgt
de: fw
fr: sgtm
it: sgtm

source: quartermaster sergeant
de: fourier
fr: fourrier
it: furiere

# quartermaster_sergeant.abbr
source: qms
de: four
fr: four
it: fur

source: first sergeant
de: hauptfeldweibel
fr: sergent-major chef
it: sergente maggiore capo

# first_sergeant.abbr
source: sfc
de: hptfw
fr: sgtm chef
it: sgtm capo

source: warrant officer class 4
de: adjutant unteroffizier
fr: adjudant sous-officier
it: aiutante sottufficiale

# warrant_officer_class_4.abbr
source: wo4
de: adj uof
fr: adj
it: aiut

source: warrant officer class 3
de: stabsadjutant
fr: adjudant d'état-major
it: aiutante di stato maggiore

# warrant_officer_class_3.abbr
source: wo3
de: stabsadj
fr: adj em
it: aiut SM

source: warrant officer class 2
de: hauptadjutant
fr: adjudant-major
it: aiutante maggiore

# warrant_officer_class_2.abbr
source: wo2
de: hptadj
fr: adj maj
it: aiut magg

source: warrant officer class_1
de: chefadjutant
fr: adjudant-chef
it: aiutante capo

# warrant_officer_class_1.abbr
source: wo1
de: chefadj
fr: adj chef
it: aiut capo

source: second lieutenant
de: leutnant
fr: lieutenant
it: tenente

# second_lieutenant.abbr
source: 2lt
de: lt
fr: lt
it: ten

source: first lieutenant
de: oberleutnant
fr: premier lieutenant
it: primo tenente

# first_lieutenant.abbr
source: lt
de: oblt
fr: plt
it: 1 ten

source: captain
de: hauptmann
fr: capitaine
it: capitano

# captain.abbr
source: capt
de: hptm
fr: cap
it: cap

source: major
it: maggiore

# major.abbr
source: maj
it: magg

source: lieutenant colonel
de: oberstleutnant
it: tenente colonnello

# lieutenant_colonel.abbr
source: lcol
de: oberstlt
fr: lt col
it: ten col

source: colonel
de: oberst
it: colonnello

source: specialist officer
de: fachoffizier
fr: officier spécialiste
it: ufficiale specialista

# specialist_officer.abbr
source: so
de: fachof
fr: of spéc
it: uff spec

source: brigadier general
de: brigadier
fr: brigadier
it: brigadiere

# brigadier_general.abbr
source: bgen
de: br
fr: br
it: br

source: major general
de: divisionn√§r
fr: divisionnaire
it: divisionario

# major_general.abbr
source: mgen
de: div
fr: div
it: div

source: lieutenant general
de: korpskommandant
fr: commandant de corps
it: commandante di corpo

# lieutenant_general.abbr
source: lgen
de: kkdt
fr: cdt c
it: cdt c

source: general
fr: général
it: generale

# corporal.abbr
source: cpl
de: kpl

# sergeant.abbr
source: sgt
de: wm

# colonel.abbr
source: col
de: oberst
